app/controllers/products_controller.rb

  def index
    @products = Product.paginate(:per_page => 3, :page => params[:page])
---
SELECT "products".* FROM "products" WHERE (price >= 40) ORDER BY created_at DESC
SELECT COUNT(*) FROM "products"

  def show
    @product = Product.find(params[:id])
    session[:review].present? ? @review = session[:review] && session.delete(:review) : @review = @product.reviews.build
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "7"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = 7 ORDER BY created_at ASC

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "7"]]

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("code", "created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["code", ""], ["created_at", Thu, 02 May 2013 15:33:05 UTC +00:00], ["description", ""], ["name", ""], ["price", nil], ["updated_at", Thu, 02 May 2013 15:33:05 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "7"]]
UPDATE "products" SET "description" = 'Bacon ipsum dolor sit amet ball tip kielbasa chuck short ribs cow, t-bone flank beef ribs salami. Pork t-bone chuck beef prosciutto. Biltong leberkas meatball, flank brisket shank capicola. Pork belly tri-tip bacon, boudin fatback ham hock strip steak turkey. Sirloin tongue meatloaf, jerky tri-tip pork belly turkey leberkas salami tenderloin prosciutto hamburger. Venison pork chop chuck jowl.

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "8"]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]