app/views/products/index.html.haml

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."product_id" = 7
---
      %td= truncate(product.description, :length => 130, :omission => '...')
      %td= product.reviews.count